from pathlib import Path

app_dir: Path = Path(__file__).parent.parent
locales_dir = app_dir / "locales"
temp_dir = app_dir / "temp"

api_url = "https://schedule.kpi.kharkov.ua/json/"
api_cab = "kabinet"
api_sport = "sport"
api_sched = "Schedule"
api_doc = "getpdf"


buttons_ua_1 = ("ℹ Загальна інформація", "📕 Залікова книжка", "📊 Рейтинг", "⚠ Борги", "📆 Розклад занять", "📆 Розклад спорт. каф.", "🗓 Навчальний план", "➡ Далі")
buttons_ru_1 = ("ℹ Общая информация", "📕 Зачётная книжка", "📊 Рейтинг", "⚠ Долги", "📆 Расписание занятий", "📆 Расписание спорт. каф.", "🗓 Учебный план", "➡ Дальше")
buttons_ua_2 = ("💳 Оплати за навчання", "📄 Семестровий план", "🔍 Пошук студентів", "📨 Новини кафедри", "❓Підтримка", "🇺🇦 Мова", "⬅ Назад")
buttons_ru_2 = ("💳 Оплаты за обучение", "📄 Семестровый план", "🔍 Поиск студентов", "📨 Новости кафедры", "❓Помощь", "🇷🇺 Язык", "⬅  Назад")
sign_in_butt = "👥 Увійти в кабінет"
req_err_msg = "😔 Не вдалося виконати запит, спробуйте пізніше"
auth_err_msg = "Помилка аутентифікації, повторіть спробу входу"
greetings_text = "*Введіть email і пароль від особистого кабінету*\n\nНаприклад:\ndemo@gmail.com d2v8F3"
faculties = ('КІТ', 'КН', 'СГТ', 'БЕМ', 'Е')

helper_ua = "*Для студентів університету розроблені персональні електронні* [кабінети](https://studcabinet.kpi.kharkov.ua) *та* [Telegram бот](https://t.me/StudCabinet_Bot)*, " \
            "які є новим форматом залікових книжок.*\n\n" \
            "*В електронному кабінеті доступні такі сервіси:*\n" \
            "— Загальна інформація про студента\n" \
            "— Дані електронної залікової книжки\n" \
            "— Рейтинг студентів за результатами сесії (для призначення стипендії)\n" \
            "— Стан академічної заборгованості за попередній період\n" \
            "— Розклад роботи всіх спортивних секцій\n" \
            "— Навчальний план (по семестрах)\n" \
            "— Всі дані про оплату навчання (для контрактників)\n\n" \
            "Також передбачена можливість завантаження в кабінет електронної версії індивідуальної семестрової відомості з подальшою її роздруківкою (за бажанням студента), " \
            "а також, в перспективі, і інших довідок, які видаються деканатами.\n\n" \
            "Інші сервіси в даний час позначені в кабінеті, як неактивні. Усі вони будуть активуватися по мірі наповнення бази автоматизованої системи управління навчальним процесом. " \
            "Серед них — оголошення факультету (інституту, кафедри), графік ліквідації академічних заборгованостей студента, " \
            "новини прес-центру університету, розклад консультацій викладачів, обрання дисциплін вільного вибору, отримання переліку вакансій від Центру кар’єри. \n\n" \
            "Розробник нового сервісу — [Інформаційно-обчислювальний центр НТУ «ХПІ»](https://web.kpi.kharkov.ua/), " \
            "який діяв на підставі рішення [Вченої ради вишу](http://blogs.kpi.kharkov.ua/v2/vr/archives/1633?fbclid=IwAR2Gqbw_ACiCe2fQOCQBTaH9BnBn0uzPWlc9lPyCLa2qpfHSSed1rm44550) від 27 вересня 2019 р.\n\n" \
            "Для зворотнього зв\'язку натисніть \\[/feedback]"

helper_ru = "*Для студентов университета разработаны персональные электронные* [кабинеты](https://studcabinet.kpi.kharkov.ua) *и* [Telegram бот](https://t.me/StudCabinet_Bot)*, " \
            "которые являются новым форматом зачётных книжек.*\n\n" \
            "*В электронном кабинете доступны такие сервисы:*\n" \
            "— Общая информация про студента\n" \
            "— Данные электронной зачётной книжки\n" \
            "— Рейтинг студентов по результатам сессии (для назначения стипендии)\n" \
            "— Состояние академической задолженности за предыдущий период\n" \
            "— Расписание работы всех спортивных секций\n" \
            "— Учебный план (по семестрам)\n" \
            "— Все данные про оплату обучения (для контрактников)\n\n" \
            "Также предусмотрена возможность загрузки в кабинет электронной версии индивидуальной семестровой ведомости с дальнейшей её распечаткой (по желанию студента), " \
            "а также, в перспективе, и других справок, которые видаются деканатами.\n\n" \
            "Другие сервисы на данный момент обозначены в кабинете, как неактивные. Все они будут активироваться по мере наполнения базы автоматизированной системы управления учебным процессом. " \
            "Среди них — объявления факультета (института, кафедры), график ликвидации академических задолженностей студента, " \
            "новости пресс-центра университета, расписание консультаций преподавателей, выбор дисциплин свободного вибора, получение списка вакансий от Центра карьеры. \n\n" \
            "Разработчик нового сервиса — [Информационно-вычислительный центр НТУ «ХПИ»](https://web.kpi.kharkov.ua/), " \
            "который действовал на основании решения [Учёного совета вуза](http://blogs.kpi.kharkov.ua/v2/vr/archives/1633?fbclid=IwAR2Gqbw_ACiCe2fQOCQBTaH9BnBn0uzPWlc9lPyCLa2qpfHSSed1rm44550) от 27 сентября 2019 г.\n\n" \
            "Для обратной связи нажмите \\[/feedback]"
